"""Error messages to tell user"""
USER_CITY_CANT_BE_FOUND_MESSAGE = ('\nК сожалению, не получилось определить '
                                   'Ваше местоположение. Попробуйте позже.\n')
INCORRECT_CITY_MESSAGE = ('\nК сожалению, не удалось найти информацию '
                          'по запрашиваемому Вами городу.\n')
SERVER_PROBLEMS_MESSAGE = ('\nК сожалению, не удалось получить ответ '
                           'от сервера. Попробуйте позже.\n')
UNKNOWN_COMMAND_MESSAGE = '\nНекорректный ввод. Попробуйте еще раз.'
DATABASE_PROBLEM_MESSAGE = '\nПроизошла ошибка в базе данных.\n'
NOT_POSITIVE_INT_MESSAGE = ('\nВведенное Вами сообщение '
                            'не является целым положительным числом. '
                            'Попробуйте еще раз.\n')
UNEXPECTED_PROBLEM_MESSAGE = ('\nПроизошла непредвиденная ошибка. '
                              'Мы уже работаем над ее исправлением.\n')
