"""Main app phrases"""
MAIN_MENU_MESSAGE = ('\nВыберите одно из действий ниже.\n'
                     '1: получить погоду в моем городе.\n'
                     '2: получить погоду в любом городе.\n'
                     '3: получить n последних запросов.\n'
                     '4: удалить историю запросов.\n'
                     '5: выйти из приложения.\n')

WHAT_CITY_MESSAGE = '\nВведите название интересующего Вас города.\n'
HOW_MANY_REQUESTS_MESSAGE = '\nСколько последних запросов Вы хотите вывести?\n'
CLOSE_APP_MESSAGE = '\nВы вышли из программы.\n'

NO_HISTORY_MESSAGE = '\nВ Вашей истории пока ничего нет.\n'
HISTORY_REMOVED_MESSAGE = '\nВаша история была успешно удалена.\n'
